qmk/qmk_firmware/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_Maxim/TARGET_MAX32610/usb_regs.h
/*******************************************************************************
 * Copyright (C) 2015 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *******************************************************************************
 */

#ifndef _MXC_USB_REGS_H_
#define _MXC_USB_REGS_H_

#ifdef __cplusplus
extern "C" {
#endif

#include <stdint.h>

/**
 * @file  usb_regs.h
 * @addtogroup usb USB
 * @{
 */

/*                                                Offset   Register Description
                                                  ======   ================================================ */
typedef struct {
    __IO uint32_t cn;                         /*  0x0000   USB Control Register                             */
    __I uint32_t rsv0004[127];                /*  0x0004                                                    */
    __IO uint32_t dev_addr;                   /*  0x0200   USB Device Address Register                      */
    __IO uint32_t dev_cn;                     /*  0x0204   USB Device Control Register                      */
    __IO uint32_t dev_intfl;                  /*  0x0208   USB Device Interrupt                             */
    __IO uint32_t dev_inten;                  /*  0x020C   USB Device Interrupt Enable                      */
    __I uint32_t rsv0210[4];                  /*  0x0210                                                    */
    __IO uint32_t ep_base;                    /*  0x0220   USB Endpoint Descriptor Table Base Address       */
    __IO uint32_t cur_buf;                    /*  0x0224   USB Current Endpoint Buffer Register             */
    __IO uint32_t in_owner;                   /*  0x0228   USB IN Endpoint Buffer Owner Register            */
    __IO uint32_t out_owner;                  /*  0x022C   USB OUT Endpoint Buffer Owner Register           */
    __IO uint32_t in_int;                     /*  0x0230   USB IN Endpoint Buffer Available Interrupt       */
    __IO uint32_t out_int;                    /*  0x0234   USB OUT Endpoint Data Available Interrupt        */
    __IO uint32_t nak_int;                    /*  0x0238   USB IN Endpoint NAK Interrupt                    */
    __IO uint32_t dma_err_int;                /*  0x023C   USB DMA Error Interrupt                          */
    __IO uint32_t buf_ovr_int;                /*  0x0240   USB Buffer Overflow Interrupt                    */
    __I uint32_t rsv0244[7];                  /*  0x0244                                                    */
    __IO uint32_t setup0;                     /*  0x0260   USB SETUP Packet Bytes 0 to 3                    */
    __IO uint32_t setup1;                     /*  0x0264   USB SETUP Packet Bytes 4 to 7                    */
    __I uint32_t rsv0268[6];                  /*  0x0268                                                    */
    __IO uint32_t ep[MXC_USB_NUM_EP];         /*  0x0280   USB Endpoint Control Registers                   */
} mxc_usb_regs_t;


/*
   Register offsets for module USB.
*/
#define MXC_R_USB_OFFS_CN                       ((uint32_t)0x00000000UL)
#define MXC_R_USB_OFFS_DEV_ADDR                 ((uint32_t)0x00000200UL)
#define MXC_R_USB_OFFS_DEV_CN                   ((uint32_t)0x00000204UL)
#define MXC_R_USB_OFFS_DEV_INTFL                ((uint32_t)0x00000208UL)
#define MXC_R_USB_OFFS_DEV_INTEN                ((uint32_t)0x0000020CUL)
#define MXC_R_USB_OFFS_EP_BASE                  ((uint32_t)0x00000220UL)
#define MXC_R_USB_OFFS_CUR_BUF                  ((uint32_t)0x00000224UL)
#define MXC_R_USB_OFFS_IN_OWNER                 ((uint32_t)0x00000228UL)
#define MXC_R_USB_OFFS_OUT_OWNER                ((uint32_t)0x0000022CUL)
#define MXC_R_USB_OFFS_IN_INT                   ((uint32_t)0x00000230UL)
#define MXC_R_USB_OFFS_OUT_INT                  ((uint32_t)0x00000234UL)
#define MXC_R_USB_OFFS_NAK_INT                  ((uint32_t)0x00000238UL)
#define MXC_R_USB_OFFS_DMA_ERR_INT              ((uint32_t)0x0000023CUL)
#define MXC_R_USB_OFFS_BUF_OVR_INT              ((uint32_t)0x00000240UL)
#define MXC_R_USB_OFFS_SETUP0                   ((uint32_t)0x00000260UL)
#define MXC_R_USB_OFFS_SETUP1                   ((uint32_t)0x00000264UL)
#define MXC_R_USB_OFFS_EP0                      ((uint32_t)0x00000280UL)
#define MXC_R_USB_OFFS_EP1                      ((uint32_t)0x00000284UL)
#define MXC_R_USB_OFFS_EP2                      ((uint32_t)0x00000288UL)
#define MXC_R_USB_OFFS_EP3                      ((uint32_t)0x0000028CUL)
#define MXC_R_USB_OFFS_EP4                      ((uint32_t)0x00000290UL)
#define MXC_R_USB_OFFS_EP5                      ((uint32_t)0x00000294UL)
#define MXC_R_USB_OFFS_EP6                      ((uint32_t)0x00000298UL)
#define MXC_R_USB_OFFS_EP7                      ((uint32_t)0x0000029CUL)


